trade_exp/src/InformationRegisters/СобытияОбъектовАльтерра/СобытияОбъектовАльтерра.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="e70f20ec-7ffe-4467-9958-8ee45b3ba97e">
  <name>СобытияОбъектовАльтерра</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <informationRegisterPeriodicity>Checked</informationRegisterPeriodicity>
    <writeMode>Checked</writeMode>
  </extension>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <dimensions extendedConfigurationObject="9d6673f6-d579-46b5-8c82-6134e22aff40">
    <name>Объект</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="bf1bcf04-f54e-4486-b6f2-435be7f36471">
    <name>Событие</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
</mdclass:InformationRegister>

trade_exp/src/InformationRegisters/СобытияОбъектовАльтерра/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
Функция ПолучитьСобытияОбъекта(ОбъектСсылка) Экспорт
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	СобытияСправочника.Объект КАК ОбъектСсылка,
	|	СобытияСправочника.Событие КАК Событие
	|ИЗ
	|	РегистрСведений.СобытияОбъектовАльтерра КАК СобытияСправочника
	|ГДЕ
	|	СобытияСправочника.Объект = &ОбъектСсылка";
	
	Запрос.УстановитьПараметр("ОбъектСсылка", ОбъектСсылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	ТЗ= РезультатЗапроса.Выгрузить();
	
	мСобытий= ТЗ.ВыгрузитьКолонку("ОбъектСсылка");
	
	УстановитьПривилегированныйРежим(Ложь);
	
	Возврат мСобытий
КонецФункции

Функция ПолучитьПоследнееСобытие(ОбъектСсылка) Экспорт
	УстановитьПривилегированныйРежим(Истина);

	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СобытияСправочника.Объект КАК ОбъектСсылка,
	|	СобытияСправочника.Событие КАК Событие
	|ИЗ
	|	РегистрСведений.СобытияОбъектовАльтерра.СрезПоследних(, ОбъектСсылка = &ОбъектСсылка) КАК СобытияСправочника";
	
	Запрос.УстановитьПараметр("ОбъектСсылка", ОбъектСсылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Возврат ВыборкаДетальныеЗаписи.Событие;
	КонецЦикла;
	
	УстановитьПривилегированныйРежим(Ложь);

	Возврат Неопределено;
	
КонецФункции

Функция БылоСобытие(ОбъектСсылка, Событие) Экспорт
	ПроверитьСобытие(Событие);
	УстановитьПривилегированныйРежим(Истина);

	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	СобытияСправочника.Объект КАК ОбъектСсылка,
	|	СобытияСправочника.Событие КАК Событие,
	|	СобытияСправочника.Период КАК Период
	|ИЗ
	|	РегистрСведений.СобытияОбъектовАльтерра КАК СобытияСправочника
	|ГДЕ
	|	СобытияСправочника.Объект = &ОбъектСсылка
	|	И СобытияСправочника.Событие = &Событие";
	
	Запрос.УстановитьПараметр("ОбъектСсылка", ОбъектСсылка);
	Запрос.УстановитьПараметр("Событие", Событие);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		Возврат Истина
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Ложь);

	Возврат Ложь;
	
КонецФункции

Процедура ПроверитьСобытие(Событие)
	если типзнч(Событие)<>тип("СправочникСсылка.СобытияОбъектовАльтерра") тогда
		Событие=Справочники.СобытияОбъектовАльтерра.ВернутьСобытиеОбъекта(Событие);
	конецесли;
КонецПроцедуры 

Процедура ЗаписатьСобытие(ОбъектСсылка, Событие) Экспорт
	ПроверитьСобытие(Событие);
	УстановитьПривилегированныйРежим(Истина);
    
	НаборЗаписей= РегистрыСведений.СобытияОбъектовАльтерра.СоздатьНаборЗаписей();
	Запись= НаборЗаписей.Добавить();
	Запись.Период= ТекущаяДата();
	Запись.Объект= ОбъектСсылка;
	Запись.Событие= Событие;
	
	НаборЗаписей.Записать(Ложь);
	
	УстановитьПривилегированныйРежим(Ложь);
КонецПроцедуры


#КонецЕсли
